---
kind: property
id: P:Autodesk.Revit.DB.Structure.LoadComponent.Factor
source: html/b7d275cc-368a-a546-7567-5c3d7fc16f75.htm
---
# Autodesk.Revit.DB.Structure.LoadComponent.Factor Property

Load component factor.

## Syntax (C#)
```csharp
public double Factor { get; set; }
```